---
kind: enumMember
id: F:Autodesk.Revit.DB.LinkLoadResultType.LinkMayBeUpgraded
enum: Autodesk.Revit.DB.LinkLoadResultType
source: html/11b095e1-24d9-91b9-ae2e-004f67c94d6e.htm
---
# Autodesk.Revit.DB.LinkLoadResultType.LinkMayBeUpgraded

Point cloud link loaded correctly but is obsolete and may be upgraded.